//Завдання 1
//Використовуючи два покажчики на масив цілих чисел, скопіювати один масив в інший.Використовувати в програмі арифметику покажчиків для просування масивом, а також оператор розіменування.
#include <iostream>
using namespace std;

//int main()
//{
//	int A[5] = { 1,2,3,4,5 };
//	int B[5];
//
//	int* p = A;
//	int* q = B;
//
//	for (int i = 0; i < 5; i++)
//	{
//		*q = *p;
//		p++;
//		q++;
//	}
//
//	for (int i = 0; i < 5; i++)
//	{
//		cout << B[i] << " ";
//	}
//
//	return 0;
//}
//Завдання 2
//Використовуючи покажчик на масив цілих чисел, змінити порядок проходження елементів масиву на протилежний.
//Використовувати в програмі арифметику покажчиків для просування масивом, а також оператор розіменування.
//int main()
//{
//	int A[5] = { 1,2,3,4,5 };
//
//	int* p = A;
//	int* q = A + 4;
//	int temp;
//
//	for (int i = 0; i < 5 / 2; i++)
//	{
//		temp = *p;
//		*p = *q;
//		*q = temp;
//		p++;
//		q--;
//	}
//
//	for (int i = 0; i < 5; i++)
//	{
//		cout << A[i] << " ";
//	}
//
//	return 0;
//}
//Завдання 3
//Використовуючи два покажчики на масиви цілих чисел, скопіювати один масив в інший так, щоб у другому масиві елементи перебували у зворотному порядку.
//Використовувати в програмі арифметику покажчиків для просування масивом, а також оператор розіменування.
/*int main()
{
	int A[5] = { 1,2,3,4,5 };
	int B[5];

	int* p = A;
	int* q = B + 4;

	for (int i = 0; i < 5; i++)
	{
		*q = *p;
		p++;
		q--;
	}

	for (int i = 0; i < 5; i++)
	{
		cout << B[i] << " ";
	}

	re*/turn 0;
}